# Create Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PhaseFilter..::..Create Method
PhaseFilter Class See Also
---
Creates a new phase filter with default status presentation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static PhaseFilter Create(
	Document document,
	string name
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	document As Document, _
	name As String _
) As PhaseFilter
```

Visual C++
---
```text
public:
static PhaseFilter^ Create(
	Document^ document,
	String^ name
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
name
    Type: System..::..String The name.
# ### Return Value
The newly created phase filter.
# Remarks
The default status presentation is ShowByCategory for New status, and ShowOverriden for Existing, Demolished and Temporary statuses.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | name is already in use. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PhaseFilter Class
Autodesk.Revit.DB Namespace